Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/ПутевкаДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевкаДоговор</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <registerRecords>AccumulationRegister.ПродажаПутевок</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/СотрудникиПользователя/СотрудникиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиПользователя</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/Ограничение/Ограничение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ограничение</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ЦеныПоВидамДичи/ЦеныПоВидамДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоВидамДичи</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСвоимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСвоимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоСезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеОсобыхЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ОграниченияДичиНаДобычу/ОграниченияДичиНаДобычу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграниченияДичиНаДобычу</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаСезон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ограничено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.ГруппыДичи</types>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Documents/ПутевкаДоговор/ManagerModule.bsl
Процедура ПолучитьТабДок(ТабДок, ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	Макет 			= Документы.ПутевкаДоговор.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Документы.ПутевкаДоговор.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	
	Ссылка 			= ПараметрыПечати.Документ;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Путевка.СезонОхоты,
	|	Путевка.МестоОхоты.НаименованиеДляПечати КАК МестоОхоты,
	|	Путевка.МестоОхоты КАК МестоОхотыСсылка,
	|	Путевка.ВидДичи,
	|	Путевка.Дата,
	|	Путевка.ДатаНачала,
	|	Путевка.ДатаОкончания,
	|	Путевка.СерияРазрешения КАК Серия,
	|	Путевка.НомерРазрешения КАК Номер,
	|	Путевка.Ответственный.Представление КАК ИсполнительФИО,
	|	Путевка.Охотхозяйство.Наименование КАК Охотхозяйство,
	|	Путевка.Охотхозяйство.ИНН КАК ИНН,
	|	Путевка.Охотхозяйство.Адрес КАК Адрес,
	|	Путевка.Охотник.Фамилия + "" "" + Путевка.Охотник.Имя + "" "" + Путевка.Охотник.Отчество КАК ОхотникФИО,
	|	Путевка.Охотник.Фамилия + "" "" + ПОДСТРОКА(Путевка.Охотник.Имя, 1, 1) + ""."" + ПОДСТРОКА(Путевка.Охотник.Отчество, 1, 1) + ""."" КАК ОхотникИнициалы,
	|	ЕСТЬNULL(ОхотничьиБилеты.КемВыдан.НаименованиеПолное, """") КАК КемВыдан,
	|	ЕСТЬNULL(ОхотничьиБилеты.КемВыдан.Наименование, """") КАК КемВыданСокр,
	|	ЕСТЬNULL(ОхотничьиБилеты.Серия, """") КАК СерияБилета,
	|	ЕСТЬNULL(ОхотничьиБилеты.Номер, """") КАК НомерБилета,
	|	Путевка.Охотхозяйство.СубъектРФ.Наименование КАК СубъектРФ,
	|	Путевка.Стоимость,
	|	ЕСТЬNULL(СотрудникиПользователя.Сотрудник.Должность.Наименование, """") КАК Должность,
	|	Путевка.МестоОхоты.ДниОхоты КАК ДниОхоты
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Документ.ПутевкаДоговор КАК Путевка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
	|		ПО Путевка.Охотник = ОхотничьиБилеты.Охотник
	|			И (ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет))
	|			И (ОхотничьиБилеты.Действует)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
	|		ПО Путевка.Ответственный = СотрудникиПользователя.Пользователь
	|ГДЕ
	|	Путевка.Ссылка В(&Ссылка)
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ограничение.Дичь КАК Дичь
	|ПОМЕСТИТЬ ВТОграничение
	|ИЗ
	|	РегистрСведений.Ограничение КАК Ограничение
	|ГДЕ
	|	(Ограничение.СезонОхоты, Ограничение.Охотхозяйство) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.СезонОхоты,
	|				Т.МестоОхотыСсылка
	|			ИЗ
	|				ВТ1 КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.СезонОхоты,
	|	ВТ1.ВидДичи,
	|	ВТ1.МестоОхоты,
	|	ВТ1.Дата,
	|	ВТ1.ДатаНачала,
	|	ВТ1.ДатаОкончания,
	|	ВТ1.Серия,
	|	ВТ1.Номер,
	|	ВТ1.ИсполнительФИО,
	|	ВТ1.Охотхозяйство,
	|	ВТ1.ИНН,
	|	ВТ1.Адрес,
	|	ВТ1.ОхотникФИО,
	|	ВТ1.ОхотникИнициалы,
	|	ВТ1.КемВыдан,
	|	ВТ1.КемВыданСокр,
	|	ВТ1.СерияБилета,
	|	ВТ1.НомерБилета,
	|	ВТ1.СубъектРФ,
	|	ВТ1.Стоимость,
	|	ВТ1.Должность,
	|	ВТ1.ДниОхоты
	|ИЗ
	|	ВТ1 КАК ВТ1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ1.ДатаНачала,
	|	ВТ1.ДатаОкончания,
	|	ПерваяСтрочкаЦены.КлючСвязи,
	|	ПерваяСтрочкаЦены.ВидДичи
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
	|			&Дата,
	|			СезонОхоты = &СезонОхоты
	|				И ВидДичи = &ВидДичи) КАК ПерваяСтрочкаЦены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПерваяСтрочкаЦены.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ2.ДатаНачала,
	|	ВТ2.ДатаОкончания,
	|	УстановкаОграниченийИЦенСостав.Дичь КАК ВидРесурсов,
	|	УстановкаОграниченийИЦенСостав.Ограничено КАК Ограничено,
	|	УстановкаОграниченийИЦенСостав.КоличествоВДень КАК КоличествоВДень,
	|	УстановкаОграниченийИЦенСостав.КоличествоЗаСезон КАК КоличествоЗаСезон,
	|	УстановкаОграниченийИЦенСостав.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ПерваяСтрочкаСостав
	|ИЗ
	|	ВТ2 КАК ВТ2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаОграниченийИЦен.Состав КАК УстановкаОграниченийИЦенСостав
	|		ПО ВТ2.КлючСвязи = УстановкаОграниченийИЦенСостав.КлючСвязи
	|ГДЕ
	|	НЕ УстановкаОграниченийИЦенСостав.Дичь В
	|				(ВЫБРАТЬ
	|					Т.Дичь
	|				ИЗ
	|					ВТОграничение КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.ДатаНачала КАК ДатаНачала,
	|	ВТ1.ДатаОкончания КАК ДатаОкончания,
	|	ОграниченияДичи.Дичь КАК ВидРесурсов,
	|	ОграниченияДичи.Ограничено,
	|	ОграниченияДичи.КоличествоВДень,
	|	ОграниченияДичи.КоличествоЗаСезон,
	|	ОграниченияДичи.НомерСтроки,
	|	ОграниченияДичи.КлючСвязи
	|ПОМЕСТИТЬ Исходная
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
	|				&Дата,
	|				СезонОхоты = &СезонОхоты
	|					И ВидДичи = &ВидДичи) КАК ЦеныПоВидамДичи
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОграниченияДичиНаДобычу.СрезПоследних(
	|					&Дата,
	|					СезонОхоты = &СезонОхоты
	|						И ВидДичи = &ВидДичи) КАК ОграниченияДичи
	|			ПО ЦеныПоВидамДичи.КлючСвязи = ОграниченияДичи.КлючСвязи
	|		ПО (ВЫБОР
	|				КОГДА &ТолькоСезонная
	|					ТОГДА ВТ1.ДатаНачала = ЦеныПоВидамДичи.ДатаНачала
	|							И ВТ1.ДатаОкончания = ЦеныПоВидамДичи.ДатаОкончания
	|				ИНАЧЕ ВТ1.ДатаНачала >= ЦеныПоВидамДичи.ДатаНачала
	|						И ВТ1.ДатаОкончания <= ЦеныПоВидамДичи.ДатаОкончания
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ ОграниченияДичи.Дичь В
	|				(ВЫБРАТЬ
	|					Т.Дичь
	|				ИЗ
	|					ВТОграничение КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(исходная.ДатаНачала, ПерваяСтрочка.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(исходная.ДатаОкончания, ПерваяСтрочка.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(исходная.ВидРесурсов, ПерваяСтрочка.ВидРесурсов) КАК ВидРесурсов,
	|	ЕСТЬNULL(исходная.Ограничено, ПерваяСтрочка.Ограничено) КАК Ограничено,
	|	ЕСТЬNULL(исходная.КоличествоВДень, ПерваяСтрочка.КоличествоВДень) КАК КоличествоВДень,
	|	ЕСТЬNULL(исходная.КоличествоЗаСезон, ПерваяСтрочка.КоличествоЗаСезон) КАК КоличествоЗаСезон,
	|	ЕСТЬNULL(исходная.НомерСтроки, ПерваяСтрочка.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Исходная КАК исходная
	|		ПОЛНОЕ СОЕДИНЕНИЕ ПерваяСтрочкаСостав КАК ПерваяСтрочка
	|		ПО исходная.ВидРесурсов = ПерваяСтрочка.ВидРесурсов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	
	мПериоды = ОхотаСервер.ПолучитьПериодыОхоты(Ссылка); 
	Периоды = мПериоды.Выгрузить();
	ТолькоСезонная = Истина;
	Для каждого стр из Периоды Цикл
		ТолькоСезонная = ТолькоСезонная И стр.ТолькоСезонная;
	КонецЦикла;		

	
	Запрос.Параметры.Вставить("ТолькоСезонная",ТолькоСезонная);
	Запрос.Параметры.Вставить("ВозрастнойПорог",Константы.ВозрастнойПорогЛьготнойСтоимости.Получить());
	Запрос.Параметры.Вставить("СезонОхоты",Ссылка.СезонОхоты);
	Запрос.Параметры.Вставить("ВидДичи",Ссылка.ВидДичи);
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("Дата",Ссылка.Дата);	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[2].Выбрать();

	УстановитьПривилегированныйРежим(Ложь);
	
	ОбластьПутевка 				= Макет.ПолучитьОбласть("Путевка");
	ОбластьПутевкаДляПечати 	= МакетДляПечати.ПолучитьОбласть("Путевка");
	
	ТабДок.Очистить();
	ТабДокДляПечати.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьПутевка.Параметры.Заполнить(Выборка);
				
		
		ГодНачалаОхоты 		= Формат(Выборка.ДатаНачала,"ДФ = гг" ); 
		МесяцНачалаОхоты	= Формат(Выборка.ДатаНачала,"ДФ = ММ" );
		ДеньНачалаОхоты		= Формат(Выборка.ДатаНачала,"ДФ = дд" ); 
		
		ГодКонецОхоты 		= Формат(Выборка.ДатаОкончания,"ДФ = гг" ); 
		МесяцКонецОхоты		= Формат(Выборка.ДатаОкончания,"ДФ = ММ" );
		ДеньКонецОхоты		= Формат(Выборка.ДатаОкончания,"ДФ = дд" ); 
		
		ГодРегистрации 		= Формат(Выборка.Дата,"ДФ = гг" ); 
		МесяцРегистрации 	= Формат(Выборка.Дата,"ДФ = ММ" ); 
		ДеньРегистрации		= Формат(Выборка.Дата,"ДФ = дд" ); 
		
		ОбластьПутевка.Параметры.КемВыданСтр1 	= Выборка.КемВыданСокр;
		
		ОбластьПутевка.Параметры.ГодНачалаОхоты 	= ГодНачалаОхоты;
		ОбластьПутевка.Параметры.МесяцНачалаОхоты 	= МесяцНачалаОхоты;
		ОбластьПутевка.Параметры.ДеньНачалаОхоты 	= ДеньНачалаОхоты;
		
		ОбластьПутевка.Параметры.ГодКонецОхоты 		= ГодКонецОхоты;
		ОбластьПутевка.Параметры.МесяцКонецОхоты 	= МесяцКонецОхоты;
		ОбластьПутевка.Параметры.ДеньКонецОхоты 	= ДеньКонецОхоты;
		
		ОбластьПутевка.Параметры.ГодОплаты 			= ГодРегистрации;
		ОбластьПутевка.Параметры.МесяцОплаты		= МесяцРегистрации;
		ОбластьПутевка.Параметры.ДеньОплаты 		= ДеньРегистрации;
		
		СтоимостьПутевки = Выборка.Стоимость;
		
		Если СтоимостьПутевки > 0 Тогда
		
			СтоимостьПутевкиСтрока = ЧислоПрописью(СтоимостьПутевки); //,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
			СтоимостьПутевкиСтрока = СтрЗаменить(СтоимостьПутевкиСтрока," 00","");
			
			ОбластьПутевка.Параметры.СтоимостьПрописью = СтоимостьПутевкиСтрока;  
			
			ОбластьПутевка.Параметры.Стоимость = СтоимостьПутевки;
		КонецЕсли;		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ОбластьПутевкаДляПечати.Параметры,ОбластьПутевка.Параметры);
	
	Выборка = Пакет[6].Выбрать();
		
		а = 1;
		ВидыРесурсов = Новый Структура;
		ВидыРесурсовДляПечати = Новый Структура;
		
		Пока Выборка.Следующий() Цикл
			ВидыРесурсов.Вставить("Номер" + Строка(а),а );
			ВидыРесурсовДляПечати.Вставить("Номер" + Строка(а),?((а=1 ИЛИ а=2),"",а ));
			
			ВидыРесурсов.Вставить("ВидРесурсов" + Строка(а),Выборка.ВидРесурсов);
			ВидыРесурсовДляПечати.Вставить("ВидРесурсов" + Строка(а),Выборка.ВидРесурсов);
			
			Если Выборка.Ограничено Тогда
				ВидыРесурсов.Вставить("Норма" + Строка(а),Строка(Макс(Выборка.КоличествоВДень,Выборка.КоличествоЗаСезон)) + " шт");
				ВидыРесурсовДляПечати.Вставить("Норма" + Строка(а),Строка(Макс(Выборка.КоличествоВДень,Выборка.КоличествоЗаСезон)) + " шт");
			Иначе
				ВидыРесурсов.Вставить("Норма" + Строка(а),"НЕОГР");
				ВидыРесурсовДляПечати.Вставить("Норма" + Строка(а),"НЕОГР");
			КонецЕсли;			
		а = а + 1; 	
		КонецЦикла;
	ОбластьПутевка.Параметры.Заполнить(ВидыРесурсов);
	ОбластьПутевкаДляПечати.Параметры.Заполнить(ВидыРесурсовДляПечати);

	ТабДок.Вывести(ОбластьПутевка);
	ТабДокДляПечати.Вывести(ОбластьПутевкаДляПечати);
	
	ТабДокДляПечати.ПолеСверху 		= 14;
	ТабДокДляПечати.ПолеСнизу 		= 5.5;
	ТабДокДляПечати.ПолеСлева 		= 18.3;
	ТабДокДляПечати.ПолеСправа 		= 0;

	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
КонецПроцедуры
